In [2]:
# Merge your DataFrames.
# Create a bubble chart that showcases the average fare versus the total number of rides with bubble size based on the total number of drivers for each city type, including urban, suburban, and rural.
# Determine the mean, median, and mode for the following:
# The total number of rides for each city type.
# The average fares for each city type.
# The total number of drivers for each city type.
# Create box-and-whisker plots that visualize each of the following to determine if there are any outliers:
# The number of rides for each city type.
# The fares for each city type.
# The number of drivers for each city type.
# Create a pie chart that visualizes each of the following data for each city type:
# The percent of total fares.
# The percent of total rides.
# The percent of total drivers.

In [4]:
%matplotlib inline

In [5]:
# import dependency
import pandas as pd
import matplotlib.pyplot as plt
import statistics
import numpy as np

In [10]:
# import ride data in Pandas as a DF
ride_data_df = pd.read_csv('resources/ride_data.csv')
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [13]:
# import city data in pd as a df
city_data_df = pd.read_csv('resources/city_data.csv')
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [15]:
# INSPECT THE CITY DATA
# get col and rows that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [16]:
# get col and rows that are null
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [18]:
# get the data type of each col
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [19]:
# get unique values of the type of city
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [22]:
# get the number of data points from the urban cities
urban = sum(city_data_df['type'] == 'Urban')
suburban = sum(city_data_df['type'] == 'Suburban')
rural = sum(city_data_df['type'] == 'Rural')

18

In [23]:
# INSPECT THE RIDE DATA

# get the col and rows that are not null
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [24]:
# get the col and rows that are null
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [25]:
# get the data type of each row
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [30]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban